app/controllers/accounts_controller.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? LIMIT ?  [["user_id", 5], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
	 def create

    @user = User.find(params[:account][:user_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."user_id" = ? LIMIT ?  [["user_id", 11], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
  def show
     @account = User.find(params[:user_id]).account

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
---
   def edit
     @account = User.find(params[:user_id])

SELECT "accounts".* FROM "accounts" WHERE "accounts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "accounts" SET "account_no" = ?, "updated_at" = ? WHERE "accounts"."id" = ?  [["account_no", "121212122122"], ["updated_at", "2022-08-12 12:39:18.456766"], ["id", 11]]
---
   def update


    @account = Account.find(params[:account_id])
    @account.update(account_no:params[:user][:account_no])