app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    if @user.save
---
INSERT INTO "users" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "reeta2"], ["description", "ddddd"], ["created_at", "2022-08-10 12:24:17.824303"], ["updated_at", "2022-08-10 12:24:17.824303"]]

  def update
    @user = User.find(params[:id])

    if @user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "description" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["description", "excellentt"], ["updated_at", "2022-08-12 10:00:31.246035"], ["id", 9]]